
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(Узел)

     Запись = Новый ЗаписьXML;
	 
	 Запись.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\Message_FROM_" + ПланыОбмена.ОбменСИдентичнойБазой.ЭтотУзел().Код  + "_TO_" +  Узел.Код + ".xml");
     Запись.ЗаписатьОбъявлениеXML();
	 
	 //Создаем запись сообщения для передачи в другую базу
	 ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	 
	 //Начинаем запись в файл XML
	 ЗаписьСообщения.НачатьЗапись(Запись, Узел);
	 
	 Выборка = ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения);
	 
	 //Обходим выборку в цикле
	 Пока Выборка.Следующий() Цикл
	 
	 	  //Получаем объекты выборки
		  Объект = Выборка.Получить();
		  
		  //Записываем объект в XML файл
		  ЗаписатьXML(Запись, Объект);
	 КонецЦикла;
	 
	 ЗаписьСообщения.ЗакончитьЗапись();

	 Запись.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере(Объект.Узел);
КонецПроцедуры
