
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Установка записи движений
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		// 1. Движение: Расход со склада-отправителя
		ДвижениеРасход = Движения.ТоварыНаСкладах.ДобавитьРасход();
		ДвижениеРасход.Период = Дата;
		ДвижениеРасход.Склад = СкладОтправитель;
		ДвижениеРасход.Номенклатура = ТекСтрокаТовары.Номенклатура;
		ДвижениеРасход.Количество = ТекСтрокаТовары.Количество;
		
		// 2. Движение: Приход на склад-получатель
		ДвижениеПриход = Движения.ТоварыНаСкладах.ДобавитьПриход();
		ДвижениеПриход.Период = Дата;
		ДвижениеПриход.Склад = СкладПолучатель;
		ДвижениеПриход.Номенклатура = ТекСтрокаТовары.Номенклатура;
		ДвижениеПриход.Количество = ТекСтрокаТовары.Количество;		
	КонецЦикла;
КонецПроцедуры
