
&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	СоздатьДоговорНаСервере();
	
	Сообщить("Создан договор");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорНаСервере()  
	
    НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	
	НовыйДоговор.Владелец = Объект.Ссылка;
	НовыйДоговор.Наименование = "Основной договор"; 
	
	НовыйДоговор.Записать();

КонецПроцедуры 


&НаКлиенте
Процедура СБ_ПроверенПриИзменении(Элемент)
	Элементы.СБ_ДатаПроверки.Доступность = Объект.СБ_Проверен;
	Элементы.СБ_Статус.Доступность = Объект.СБ_Проверен;
	
	Если Объект.СБ_Проверен Тогда
		Объект.СБ_ДатаПроверки = ТекущаяДата();
	Иначе
		Объект.СБ_ДатаПроверки = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

