
Процедура Расш1_ПриПроведенииДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Не КонтрольОстатков(Источник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Источник.Движения.СБ_СебестоимостьТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
		Движение = Источник.Движения.СБ_СебестоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник.Дата;
		Движение.СБ_Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СБ_Склад = Источник.Склад;
		Движение.СБ_Количество = ТекСтрокаТовары.Количество;
		Движение.СБ_Себестоимость = КонтрольСебестоимость(Источник.Склад,ТекСтрокаТовары.Номенклатура)*ТекСтрокаТовары.Количество; 
	КонецЦикла;
	
КонецПроцедуры

Функция КонтрольОстатков(Источник) Экспорт
	Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток,0) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(
			|			,
			|			Склад = &Склад
			|				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки";
		
		Запрос.УстановитьПараметр("Склад", Источник.Склад);
		Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Если ВыборкаДетальныеЗаписи.КоличествоОстаток < ТекСтрокаТовары.Количество Тогда
			Сообщить("Товара: "+ТекСтрокаТовары.Номенклатура+" нет на складе в таком количестве, на складе сейчас "+ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Возврат Ложь;			
		КонецЕсли;
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА 
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция КонтрольСебестоимость(Склад, Номенклатура) Экспорт
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СБ_СебестоимостьТоваровОбороты.СБ_КоличествоПриход КАК СБ_КоличествоПриход,
			|	СБ_СебестоимостьТоваровОбороты.СБ_СебестоимостьПриход КАК СБ_СебестоимостьПриход
			|ИЗ
			|	РегистрНакопления.СБ_СебестоимостьТоваров.Обороты(
			|			,
			|			,
			|			,
			|			СБ_Номенклатура = &Номенклатура
			|				И СБ_Склад = &Склад) КАК СБ_СебестоимостьТоваровОбороты";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.СБ_СебестоимостьПриход/ВыборкаДетальныеЗаписи.СБ_КоличествоПриход;
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА 
КонецФункции

