
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()

	Файл = Новый ЧтениеXML;
	
	//Указываем путь к файлу
	Файл.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\upload.xml");
	
	//Поочередный перебор узлов файл
	Пока Файл.Прочитать() Цикл
		
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НаборРеквизитов = Новый Структура;
			
			//Считываем все атрибуты элемента
			Пока Файл.ПрочитатьАтрибут() Цикл
				
				НаборРеквизитов.Вставить(Файл.Имя, Файл.Значение);
			КонецЦикла; 
			
			//Создаем элемент, только если в Структуре есть значения атрибутов
			Если НаборРеквизитов.Количество() Тогда
				
				Если Файл.Прочитать() Тогда
					
					
					//Проверка типа узла
					Если файл.ТипУзла = ТипУзлаXML.Текст Тогда
						
						НаборРеквизитов.Вставить("Наименование", Файл.Значение);
						
						
						//Поиск ссылки на номенклатуру
						СсылкаНаНоменклатуру = Справочники.Номенклатура.НайтиПоНаименованию(НаборРеквизитов.Наименование);
						
						
						Если Не ЗначениеЗаполнено(СсылкаНаНоменклатуру) Тогда
							
							//В зависимости от атрибута ЭтоГруппа создаем либо группу, либо элемент
							Если НаборРеквизитов.ЭтоГруппа = "1" Тогда
								
								НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
								
								ЗаполнитьЗначенияСвойств(НоваяГруппа, НаборРеквизитов, "Наименование, Код");
								
								НоваяГруппа.Записать();
								
								
							ИначеЕсли НаборРеквизитов.ЭтоГруппа = "0" Тогда
								
								НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
								
								ЗаполнитьЗначенияСвойств(НовыйЭлемент, НаборРеквизитов); 
								
								НовыйЭлемент.Записать();
								
							КонецЕсли;
							
							
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
	////1_Структура: объявление ключей и значений позже в коде
	//НоваяСтруктура = Новый Структура;
	//НоваяСтруктура.Вставить("Номер", 11);
	//НоваяСтруктура.Вставить("Имя", "Анна");
	//
	////2_Структура: объявление ключей, значения позже в коде
	//НоваяСтруктура_2 = Новый Структура("Ключ_1, Ключ_2"); 
	//НоваяСтруктура_2.Ключ_1 = 33;
	//НоваяСтруктура_2.Ключ_2 = 66;
	//
	////3_Структура: объявление ключей и значений сразу	
	//НоваяСтруктура_3 = Новый Структура("Ключ_1, Ключ_2", 55, 77); 

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
