
Процедура ПередЗаписью(Отказ)
	
	//РасчетныеПроцедуры.РассчитатьСумму();
	////РассчитатьСумму();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
     ПроверяемыеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)

	//Установка префикса в зависимости от вида склада
	Если ВидСклада = Перечисления.ТипСклада.ГотоваяПродукция Тогда
	
	     Префикс = "ГП-";
	ИначеЕсли  ВидСклада = Перечисления.ТипСклада.Комплектующие Тогда
	
	     Префикс = "К-";
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Адрес = "";
	
КонецПроцедуры

//Процедура ПередЗаписью(Отказ)
//	
//	Сообщить("Сработала процедура модуля объекта ПередЗаписью!");
//	
//КонецПроцедуры

//Процедура ПриЗаписи(Отказ)
//	
//	Сообщить("Сработала процедура модуля объекта ПриЗаписи!");
//	
//КонецПроцедуры
