
&НаСервере
Процедура ЗагрузитьНаСервере()

	 //РаботаСМассивами();
	 //РаботаСЦиклами();
	 
	 //Получить текстовый документ
	 Документ = Новый ТекстовыйДокумент;
	 Документ.Прочитать(Объект.ПутьКФайлу); 
	 
	 //Построчный обход текстового документа
	 Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		 
		 //Получить строку документа
		 СтрокаДокумента = Документ.ПолучитьСтроку(НомерСтроки);
		 
		 //Разложим каждое значение, разделенное ; в массив
		 МассивЗначенийСтроки = СтрРазделить(СтрокаДокумента, ";");
		 
		 //Получить значение массива
		 ВидСклада          =  МассивЗначенийСтроки[0];
		 НаименованиеСклада =  МассивЗначенийСтроки[1];
		 Адрес              =  МассивЗначенийСтроки[2];
		 
		 
		 СсылкаНаСклад = Справочники.Склады.НайтиПоНаименованию(НаименованиеСклада);
		 
		 Если Не ЗначениеЗаполнено(СсылкаНаСклад) Тогда
			 
			 //Создать элемент
			 НовыйЭлементСклада = Справочники.Склады.СоздатьЭлемент();
			 
			 НовыйЭлементСклада.Наименование = НаименованиеСклада;
			 НовыйЭлементСклада.Адрес        = Адрес;
			 
			 Если ВидСклада = "Готовая продукция" Тогда
				 
				 НовыйЭлементСклада.ВидСклада = Перечисления.ТипСклада.ГотоваяПродукция; 
				 
			 ИначеЕсли ВидСклада = "Комплектующие" Тогда
				 
				 НовыйЭлементСклада.ВидСклада = Перечисления.ТипСклада.Комплектующие;
			 КонецЕсли;
			 
			 НовыйЭлементСклада.Записать();
		 Иначе
			 Продолжить;// Возвращаем выполнение кода в начало цикла
		 КонецЕсли;
	 КонецЦикла;
	 

КонецПроцедуры

&НаСервере
Процедура РаботаСЦиклами()
	
	Перем МассивДанных, ПоследнийЭлемент, Счетчик, СчетчикПоУсловию, ЭлементМассива;
	
	//Цикл по счетчику
	ПоследнийЭлемент = 10;
	
	Для Счетчик = 1 По ПоследнийЭлемент Цикл
		
		Если Счетчик = 7 Тогда
			//Прервать;
			Продолжить;
		КонецЕсли;
		
		//Сообщить(Счетчик);
		
	КонецЦикла;
	
	//Цикл по условию
	СчетчикПоУсловию = 1;
	Пока СчетчикПоУсловию < 5 Цикл
		
		//Сообщить(СчетчикПоУсловию);
		
		СчетчикПоУсловию = СчетчикПоУсловию + 1;
	КонецЦикла; 
	
	//Цикл по колллекциям
	МассивДанных = Новый Массив (3);
	
	МассивДанных[0] = "Первый элемент";
	МассивДанных[1] = "Второй элемент";
	МассивДанных[2] = "Третий элемент";
	
	
	Для каждого ЭлементМассива Из МассивДанных Цикл
		
		Сообщить(ЭлементМассива);
		
	КонецЦикла;
	
	
	Сообщить("Выполнение цикла завершено");

КонецПроцедуры

// Процедура - Работа с массивами
//Список методов для работы с массивам
&НаСервере
Процедура РаботаСМассивами()
	
	Перем ЗначениеПоИндексу, КоличествоСтрок, МаксимальныйИндекс, МатрицаКуб, МатрицаСписок, МатрицаТаблица;
	
	МатрицаТаблица = Новый Массив (5, 2);
	МатрицаКуб     = Новый Массив (5, 2, 4);
	МатрицаСписок  = Новый Массив (5);
	
	//Добавить еще один элемент в массив
	МатрицаСписок.Добавить();
	
	//Установка значения элементов массив
	МатрицаСписок.Вставить(2, "Третий элемент"); 
	
	//При указании индекса превышающего максимальный
	МатрицаСписок.Вставить(100, "101-ый элемент");
	
	//Определение количества строк и индексов
	КоличествоСтрок    = МатрицаСписок.Количество();
	МаксимальныйИндекс = МатрицаСписок.ВГраница();
	
	Сообщить("Количество строк: " + КоличествоСтрок);
	Сообщить("Максимальный индекс: " + МаксимальныйИндекс);
	
	//Установка значений массива и получение данных из массива
	ЗначениеПоИндексу = МатрицаСписок[2];
	МатрицаСписок[45] = "Элемент с индексом 45";

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

// Процедура - Путь к файлу начало выбора
// Интерактивная работа с внешним файлом
// Параметры:
//  Элемент				 - Элемент формы	 -   Содежит значение элемента формы
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - Булево	 -  Признак стандартной обработки
//
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	

	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите CSV файл'")
	+ "(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите CSV файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда

		 Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;

	КонецЕсли;
	
	
	
КонецПроцедуры
