
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере()

	//Сделаем выборку элементов номенклатура
	ВыборкаНоменклатуры = Справочники.Номенклатура.Выбрать();
	
	//Создать файл XML
	Файл = Новый ЗаписьXML;
	
	//Указываем путь к файлу
	Файл.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\upload.xml");
	
	//Техническая информация
	Файл.ЗаписатьОбъявлениеXML();
	
	Файл.ЗаписатьНачалоЭлемента("Root");
	
	
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		ЭлементВыборки = ВыборкаНоменклатуры.Ссылка;
		
		//Добавить элементы в файл
		Файл.ЗаписатьНачалоЭлемента("Номенклатура");
		
		//Добавляем атрибуты
		файл.ЗаписатьАтрибут("Код" , ВыборкаНоменклатуры.Код);
		файл.ЗаписатьАтрибут("ЦенаЗакупки" , Строка(ВыборкаНоменклатуры.ЦенаЗакупки));
		файл.ЗаписатьАтрибут("ЦенаРеализации" , Строка(ВыборкаНоменклатуры.ЦенаРеализации));
		
		//Если ВыборкаНоменклатуры.ЭтоГруппа Тогда
		//
		//	ПараметрГруппы = "1";
		//Иначе
		//	ПараметрГруппы = "0";
		//КонецЕсли;
		
		файл.ЗаписатьАтрибут("ЭтоГруппа" , ?(ВыборкаНоменклатуры.ЭтоГруппа, "1", "0"));
		
		Файл.ЗаписатьТекст(ВыборкаНоменклатуры.Наименование);
		
		//Закрываем элемент
		файл.ЗаписатьКонецЭлемента();
		
		
	КонецЦикла; 
	
	//Закрываем корневой узел
	Файл.ЗаписатьКонецЭлемента();
	
	//Запись файла на диске
	Файл.Закрыть();
	
	

КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьГруппыНаСервере()

	//Сделаем выборку элементов номенклатура
	ВыборкаНоменклатуры = Справочники.Номенклатура.Выбрать();
	
	//Создать файл XML
	Файл = Новый ЗаписьXML;
	
	//Указываем путь к файлу
	Файл.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\upload_grooups.xml");
	
	//Техническая информация
	Файл.ЗаписатьОбъявлениеXML();
	
	Файл.ЗаписатьНачалоЭлемента("Root");
	
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		Если Не ВыборкаНоменклатуры.ЭтоГруппа Тогда
		    Продолжить;
		КонецЕсли;
		
		ЭлементВыборки = ВыборкаНоменклатуры.Ссылка;
		
		//Добавить элементы в файл
		Файл.ЗаписатьНачалоЭлемента("Номенклатура");
		
		//Добавляем атрибуты
		файл.ЗаписатьАтрибут("Код" , ВыборкаНоменклатуры.Код);
		файл.ЗаписатьАтрибут("ЦенаЗакупки" , Строка(ВыборкаНоменклатуры.ЦенаЗакупки));
		файл.ЗаписатьАтрибут("ЦенаРеализации" , Строка(ВыборкаНоменклатуры.ЦенаРеализации));
		файл.ЗаписатьАтрибут("НаименованиеРодителя" , Строка(ВыборкаНоменклатуры.Родитель.Наименование));
		
		//Если ВыборкаНоменклатуры.ЭтоГруппа Тогда
		//
		//	ПараметрГруппы = "1";
		//Иначе
		//	ПараметрГруппы = "0";
		//КонецЕсли;
		
		файл.ЗаписатьАтрибут("ЭтоГруппа" , ?(ВыборкаНоменклатуры.ЭтоГруппа, "1", "0"));
		
		Файл.ЗаписатьТекст(ВыборкаНоменклатуры.Наименование);
		
		//Закрываем элемент
		файл.ЗаписатьКонецЭлемента();
		
		
	КонецЦикла; 
	
	//Закрываем корневой узел
	Файл.ЗаписатьКонецЭлемента();
	
	//Запись файла на диске
	Файл.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьГруппы(Команда)
	ВыгрузитьГруппыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЭлементыНаСервере()

	//Сделаем выборку элементов номенклатура
	ВыборкаНоменклатуры = Справочники.Номенклатура.Выбрать();
	
	//Создать файл XML
	Файл = Новый ЗаписьXML;
	
	//Указываем путь к файлу
	Файл.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\upload_item.xml");
	
	//Техническая информация
	Файл.ЗаписатьОбъявлениеXML();
	
	Файл.ЗаписатьНачалоЭлемента("Root");
	
	
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		Если ВыборкаНоменклатуры.ЭтоГруппа Тогда
		    Продолжить;
		КонецЕсли;

		ЭлементВыборки = ВыборкаНоменклатуры.Ссылка;
		
		//Добавить элементы в файл
		Файл.ЗаписатьНачалоЭлемента("Номенклатура");
		
		//Добавляем атрибуты
		файл.ЗаписатьАтрибут("Код" , ВыборкаНоменклатуры.Код);
		файл.ЗаписатьАтрибут("ЦенаЗакупки" , Строка(ВыборкаНоменклатуры.ЦенаЗакупки));
		файл.ЗаписатьАтрибут("ЦенаРеализации" , Строка(ВыборкаНоменклатуры.ЦенаРеализации));
		файл.ЗаписатьАтрибут("НаименованиеРодителя" , Строка(ВыборкаНоменклатуры.Родитель.Наименование));
		
		//Если ВыборкаНоменклатуры.ЭтоГруппа Тогда
		//
		//	ПараметрГруппы = "1";
		//Иначе
		//	ПараметрГруппы = "0";
		//КонецЕсли;
		
		файл.ЗаписатьАтрибут("ЭтоГруппа" , ?(ВыборкаНоменклатуры.ЭтоГруппа, "1", "0"));
		
		Файл.ЗаписатьТекст(ВыборкаНоменклатуры.Наименование);
		
		//Закрываем элемент
		файл.ЗаписатьКонецЭлемента();
		
		
	КонецЦикла; 
	
	//Закрываем корневой узел
	Файл.ЗаписатьКонецЭлемента();
	
	//Запись файла на диске
	Файл.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭлементы(Команда)
	ВыгрузитьЭлементыНаСервере();
КонецПроцедуры
