
&НаСервере
Процедура ЗагрузитьНаСервере()

   Чтение = Новый ЧтениеXML;
   Чтение.ОткрытьФайл("C:\Users\Makoveev Aleksandr\Desktop\Обмен\Message_FROM_" + Объект.Узел.Код  + "_TO_" +  ПланыОбмена.ОбменСИдентичнойБазой.ЭтотУзел().Код + ".xml");
   
   //Создаем объект для чтения сообщения
   ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
   
   //Начинаем чтение из файла
   ЧтениеСообщения.НачатьЧтение(Чтение);
   
   //читаем XML
   Пока ВозможностьЧтенияXML(Чтение) Цикл
   
   	    //Чтение объекта из файла
		ОбъектФайла = ПрочитатьXML(Чтение);
		
		ОбъектФайла.Записать();
	КонецЦикла;                 
	
	//Удалить регистрацию объектов по узлу отправителю
	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	
	//Завершаем чтение
	ЧтениеСообщения.ЗакончитьЧтение();
	
	Чтение.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
