
&НаСервере
Процедура ВидСкладаПриИзмененииНаСервере()
	
	Если  Объект.ВидСклада = Перечисления.ТипСклада.Комплектующие Тогда
		Элементы.Адрес.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСкладаПриИзменении(Элемент)
	ВидСкладаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

   //РасчетныеПроцедуры.РассчитатьСумму();

КонецПроцедуры


//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	Сообщить("Сработала процедура на форме при открытии!");
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Сообщить("Сработала процедура на форме при создании на сервере!");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	
//	Сообщить("Сработала процедура на форме ПередЗаписью!");
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	Сообщить("Сработала процедура на форме ПередЗаписьюНаСервере!");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеЗаписи(ПараметрыЗаписи)
//	
//	Сообщить("Сработала процедура на форме ПослеЗаписи!");
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
//	
//	Сообщить("Сработала процедура на форме ПриЗаписиНаСервере!");
//	
//КонецПроцедуры
